{
  "docstring": "This is the place where you can describe the complete module/dataset and give information about all the details. Markdown offers a convenient way to enable as much space as needed to elucidate purpose and capabilities of your data model.",
  "Root": {
    "attributes": {
      "description": {
        "description": "Describes the content of the dataset.",
        "dataverse": "pyDaRUS.Citation.description.text"
      },
      "title": {
        "description": "Title of the work",
        "dataverse": "pyDaRUS.Citation.title"
      },
      "subject": {
        "description": "Subject of matter linked to the dataset",
        "dataverse": "pyDaRUS.Citation.subject"
      },
      "authors": {
        "multiple": "True",
        "description": "Authors of this dataset."
      },
      "parameters": {
        "multiple": "True",
        "description": "Parameters to start and configure some process"
      }
    },
    "docstring": "This is the root of the data model and contains all objects defined in this example. While its good practice to have a single root, you can define as many roots as you like. Furthermore, the name does not have to be ```Root``` and can be any other name.\n"
  },
  "Author": {
    "attributes": {
      "name": {
        "description": "Full name including given and family name",
        "dataverse": "pyDaRUS.Citation.author.name"
      },
      "affiliation": {
        "description": "To which organization the author is affiliated to",
        "dataverse": "pyDaRUS.Citation.author.affiliation"
      }
    },
    "docstring": "This is another object that represents the author of the dataset. Please note, that the options here contain all required fields but also custom ones. In this example, the ```Dataverse``` option specifies where each field should be mapped, when exported to a Dataverse format. Hence, these options allow you to link your dataset towards any other data model without writing code by yourself.\n"
  },
  "Parameter": {
    "attributes": {
      "key": {
        "description": "Name of the parameter",
        "dataverse": "pyDaRUS.Process.method_parameters.name"
      },
      "value": {
        "description": "Respective value of a parameter",
        "dataverse": "pyDaRUS.Process.method_parameters.value"
      }
    },
    "docstring": "This is another object used to describe the parameters of given dataset. As a final note, it is important to use the description of an object to its fullest. As you might noticed, the space in between the object definition ```###``` can be freely used to describe what this object is actually about. Ultimately, this gives you the opportunity to ensure users completely understand what the intention and use case of this object is in a readable way."
  }
}